// JavaScript Document
function StateCountyLinkage()
{
	var stateCountyMap = {
	"北京市":["东城区","西城区","崇文区","宣武区","海淀区","朝阳区","丰台区","石景山区","通州区","顺义区","平谷区","怀柔区","房山区","门头沟区","大兴区","昌平区","延庆县","密云县"],
	"上海市":["黄浦区","卢湾区","徐汇区","长宁区","静安区","普陀区","闸北区","虹口区","杨浦区","闵行区","宝山区","嘉定区","浦东新区","金山区","松江区","南汇区","奉贤区","青浦区","崇明县","川沙区"],
	"天津市":["和平区","河东区","河西区","南开区","河北区","红桥区","塘沽区","汉沽区","大港区","东丽区","西青区","津南区","北辰区","宁河县","武清区","静海县","宝坻区","蓟县"],
	"重庆市":["巴南区","北碚区","壁山县","长寿区","城口县","大渡口区","大足县","垫江县","丰都县","奉节县","合川区","江北区","江津区","九龙坡区","开县","梁平县","南岸区","南川市","涪陵区","彭水苗族土家族自治县","黔江区","綦江县","荣昌县","沙坪坝区","石柱土家族自治县","双桥区","铜梁县","潼南县","万盛区","万州区","武隆县","巫山县","巫溪县","秀山土家族苗族自治县","永川市","酉阳土家族苗族自治县","云阳县","渝北区","渝中区","忠县"],
	"安徽省":["安庆市","蚌埠市","巢湖市","池州市","滁州市","阜阳市","毫州市","合肥市","淮北市","淮南市","黄山市","六安市","马鞍山市","宿州市","铜陵市","芜湖市","宣城市"],
	"福建省":["福州市","龙岩市","南平市","宁德市","莆田市","泉州市","三明市","厦门市","漳州市"],
	"甘肃省":["嘉峪关市","酒泉市","兰州市","金昌市","白银市","天水市","武威市","张掖市","平凉市","庆阳市","定西市","陇南市","临夏回族自治州","甘南藏族自治州"],
	"广东省":["潮洲市","东莞市","佛山市","广州市","河源市","惠州市","江门市","茂名市","清远市","汕头市","汕尾市","韶关市","深圳市","顺德市","湛江市","肇庆市","中山市","珠海市","梅州市","揭阳市","云浮市","阳江市"],
	"广西壮族自治区":["北海市","桂林市","柳州市","南宁市","玉林市","梧州市","防城港市","钦州市","贵港市","百色市","贺州市","河池市","来宾市","崇左市"],
	"贵州省":["贵阳市","遵义市","六盘水市","安顺市","铜仁地区","毕节地区","黔西南布依族苗族自治州","黔东南苗族侗族自治州","黔南布依族苗族自治州"],
	"海南省":["海口市","三亚市","五指山市","琼海市","儋州市","文昌市","万宁市","东方市","澄迈县","定安县","屯昌县","临高县","白沙黎族自治县","昌江黎族自治县","乐东黎族自治县","陵水黎族自治县","保亭黎族苗族自治县","琼中黎族苗族自治县"],
	"河北省":["保定市","沧州市","承德市","邯郸市","衡水市","廊坊市","秦皇岛市","石家庄市","唐山市","邢台市","张家口市"],
	"河南省":["开封市","洛阳市","郑州市","平顶山市","安阳市","鹤壁市","新乡市","焦作市","濮阳市","许昌市","漯河市","三门峡市","南阳市","商丘市","信阳市","周口市","驻马店市","济源市"],
	"黑龙江省":["大庆市","哈尔滨市","佳木斯市","牡丹江市","齐齐哈尔市","鹤岗市","双鸭山市","鸡西市","伊春市","七台河市","黑河市","绥化市","大兴安岭地区"],
	"湖北省":["黄石市","荆门市","荆州市","潜江市","十堰市","武汉市","襄樊市","宜昌市","鄂州市","孝感市","黄冈市","咸宁市","随州市","仙桃市","天门市","神农架林区","恩施土家族苗族自治州"],
	"湖南省":["常德市","长沙市","郴州市","衡阳市","湘潭市","益阳市","岳阳市","株洲市","邵阳市","张家界市","永州市","怀化市","娄底市","湘西土家族苗族自治州"],
	"吉林省":["长春市","吉林市","四平市","辽源市","通化市","白山市","松原市","白城市","延边朝鲜族自治州"],
	"江苏省":["常熟市","常州市","昆山市","连云港市","南京市","南通市","苏州市","太仓市","无锡市","徐州市","盐城市","扬州市","镇江市","泰州市","淮安市","宿迁市","吴江市","张家港市"],
	"江西省":["九江市","南昌市","景德镇市","萍乡市","新余市","鹰潭市","赣州市","吉安市","宜春市","抚州市","上饶市"],
	"辽宁省":["鞍山市","大连市","葫芦岛市","沈阳市","抚顺市","本溪市","丹东市","锦州市","营口市","阜新市","辽阳市","盘锦市","铁岭市","朝阳市"],
	"内蒙古自治区":["包头市","赤峰市","呼和浩特市","乌海市","通辽市","鄂尔多斯市","呼伦贝尔市","巴彦淖尔市","乌兰察布市","锡林郭勒盟","兴安盟","阿拉善盟"],
	"宁夏自治区":["银川市","石嘴山市","吴忠市","固原市","中卫市"],
	"青海省":["西宁市","海东地区","海北藏族自治州","黄南藏族自治州","海南藏族自治州","果洛藏族自治州","玉树藏族自治州","海西蒙古族藏族自治州"],
	"山东省":["德州市","东营市","济南市","济宁市","临沂市","青岛市","日照市","泰安市","威海市","潍坊市","烟台市","淄博市","枣庄市","莱芜市","聊城市","滨州市","菏泽市"],
	"山西省":["大同市","临汾市","太原市","运城市","阳泉市","长治市","晋城市","朔州市","晋中市","忻州市","吕梁市"],
	"陕西省":["宝鸡","西安市","咸阳市","铜川市","渭南市","延安市","汉中市","榆林市","安康市","商洛市"],
	"四川省":["成都市","乐山市","泸州市","绵阳市","内江市","宜宾市","自贡市","攀枝花市","德阳市","广元市","遂宁市","南充市","眉山市","广安市","达州市","雅安市","巴中市","资阳市","阿坝藏族羌族自治州","甘孜藏族自治州","凉山彝族自治州"],
	"西藏自治区":["拉萨市","日喀则市","那曲地区","昌都地区","山南地区","阿里地区","林芝地区"],
	"新疆自治区":["喀什市","克拉玛依市","乌鲁木齐市","伊犁市","石河子市","阿拉尔市","图木舒克市","五家渠市","吐鲁番市","阿克苏市","哈密市","和田市","阿图什市","库尔勒市","昌吉市","阜康市","米泉市","博乐市","伊宁市","奎屯市","塔城市","乌苏市","阿勒泰市"],
	"云南省":["大理市","昆明市","丽江市","玉溪市","曲靖市","保山市","昭通市","思茅市","临沧市","文山壮族苗族自治州","红河哈尼族彝族自治州","西双版纳傣族自治州","楚雄彝族自治州","大理白族自治州","德宏傣族景颇族自治州","怒江傈傈族自治州","迪庆藏族自治州"],
	"浙江省":["杭州市","湖州市","嘉兴市","金华市","丽水市","宁波市","绍兴市","台州市","温州市","衢州市","舟山市"],
	"澳门特别行政区":["澳门"],
	"中国台湾":["台北市","高雄市","基隆市","台中市","台南市","新竹市","嘉义市","台北县","宜兰县","桃园县","新竹县","苗栗县","台中县","彰化县","南投县","云林县","嘉义县","台南县","高雄县","屏东县","澎湖县","台东县","花莲县"],
	"香港特别行政区":["香港"],
	"海外地区":["亚洲","欧洲","非洲","南美洲","北美洲","大洋洲"],
	"其他":["其他"]}; 

	function getCounty(state)
	{
		return stateCountyMap[state];
	}
	
	function newOption(value, text)
	{
		var oOption = document.createElement("OPTION");
		oOption.value=value;
		oOption.text=text;
		return oOption;
	}
	
	this.fillCounty = function(state, oSelect)
	{
		oSelect.innerHTML="";
		oSelect.options.add(newOption("","全部"));
		var countyList = getCounty(state);
		for(var i=0; countyList != null && i < countyList.length; i++){
			oSelect.options.add(newOption(countyList[i], countyList[i]));
		}
	}

	this.fillState = function(oSelect)
	{
		oSelect.options.add(newOption("","全部"));
		for(var key in stateCountyMap){
			oSelect.options.add(newOption(key, key));
		}
	}
	
}














